app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 10]]
---
  def show
    @song = Song.find(params[:id]).page(params[:page])